altschmerzsiuu/hq/ESP32C3SuperMini_Production.ino

#include <ArduinoOTA.h>
#include <DallasTemperature.h>
#include <ESPmDNS.h>
#include <MPU9250_WE.h> // MPU9250 WE library for purple module
#include <NTPClient.h>
#include <OneWire.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <WiFiClientSecure.h> // Secure TLS client
#include <WiFiUdp.h>
#include <Wire.h>
#include <esp_random.h> // Secure random
#include <esp_task_wdt.h>

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 1: FIRMWARE METADATA & VERSIONING
 * ═══════════════════════════════════════════════════════════════════════ */

#define FIRMWARE_VERSION "4.5.1"
#define BUILD_DATE __DATE__
#define BUILD_TIME __TIME__
#define HARDWARE_REVISION "ESP32-C3_v1.2"

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 2: SECURITY CONFIGURATION
 * ═══════════════════════════════════════════════════════════════════════ */

// MQTTS Root CA Certificate (ISRG Root X1 - Let's Encrypt)
// TODO: Replace with your VPS certificate after deployment
const char *ca_cert =
    "-----BEGIN CERTIFICATE-----\n"
    "MIIFazCCA1OgAwIBAgIRAIIQz7DSQONZRGPgu2OCiwAwDQYJKoZIhvcNAQELBQAw\n"
    "TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh\n"
    "cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMTUwNjA0MTEwNDM4\n"
    "WhcNMzUwNjA0MTEwNDM4WjBPMQswCQYDVQQGEwJVUzEpMCcGA1UEChMgSW50ZXJu\n"
    "ZXQgU2VjdXJpdHkgUmVzZWFyY2ggR3JvdXAxFTATBgNVBAMTDElTUkcgUm9vdCBY\n"
    "MTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAK3oJHP0FDfzm54rVygc\n"
    "h77ct984kIxuPOZXoHj3dcKi/vVqbvYATyjb3miGbESTtrFj/RQSa78f0uoxmyF+\n"
    "0TM8ukj13Xnfs7j/EvEhmkvBioZxaUpmZmyPfjxwv60pIgbz5MDmgK7iS4+3mX6U\n"
    "A5/TR5d8mUgjU+g4rk8Kb4Mu0UlXjIB0ttov0DiNewNwIRt18jA8+o+u3dpjq+sW\n"
    "T8KOEUt+zwvo/7V3LvSye0rgTBIlDHCNAymg4VMk7BPZ7hm/ELNKjD+Jo2FR3qyH\n"
    "B5T0Y3HsLuJvW5iB4YlcNHlsdu87kGJ55tukmi8mxdAQ4Q7e2RCOFvu396j3x+UC\n"
    "B5iPNgiV5+I3lg02dZ77DnKxHZu8A/lJBdiB3QW0KtZB6awBdpUKD9jf1b0SHzUv\n"
    "KBds0pjBqAlkd25HN7rOrFleaJ1/ctaJxQZBKT5ZPt0m9STJEadao0xAH0ahmbWn\n"
    "OlFuhjuefXKnEgV4We0+UXgVCwOPjdAvBbI+e0ocS3MFEvzG6uBQE3xDk3SzynTn\n"
    "jh8BCNAw1FtxNrQHusEwMFxIt4I7mKZ9YIqioymCzLq9gwQbooMDQaHWBfEbwrbw\n"
    "qHyGO0aoSCqI3Haadr8faqU9GY/rOPNk3sgrDQoo//fb4hVC1CLQJ13hef4Y53CI\n"
    "rU7m2Ys6xt0nUW7/vGT1M0NPAgMBAAGjQjBAMA4GA1UdDwEB/wQEAwIBBjAPBgNV\n"
    "HRMBAf8EBTADAQH/MB0GA1UdDgQWBBR5tFnme7bl5AFzgAiIyBpY9umbbjANBgkq\n"
    "hkiG9w0BAQsFAAOCAgEAVR9YqbyyqFDQDLHYGmkgJykIrGF1XIpu+ILlaS/V9lZL\n"
    "ubhzEFnTIZd+50xx+7LSYK05qAvqFyFWhfFQDlnrzuBZ6brJFe+GnY+EgPbk6ZGQ\n"
    "3BebYhtF8GaV0nxvwuo77x/Py9auJ/GpsMiu/X1+mvoiBOv/2X/qkSsisRcOj/KK\n"
    "NFtY2PwByVS5uCbMiogziUwthDyC3+6WVwW6LLv3xLfHTjuCvjHIInNzktHCgKQ5\n"
    "ORAzI4JMPJ+GslWYHb4phowim57iaztXOoJwTdwJx4nLCgdNbOhdjsnvzqvHu7Ur\n"
    "TkXWStAmzOVyyghqpZXjFaH3pO3JLF+l+/+sKAIuvtd7u+Nxe5AW0wdeRlN8NwdC\n"
    "jNPElpzVmbUq4JUagEiuTDkHzsxHpFKVK7q4+63SM1N95R1NbdWhscdCb+ZAJzVc\n"
    "oyi3B43njTOQ5yOf+1CceWxG1bQVs5ZufpsMljq4Ui0/1lvh+wjChP4kqKOJ2qxq\n"
    "4RgqsahDYVvTH9w7jXbyLeiNdd8XM2w9U/t7y0Ff/9yi0GE44Za4rF2LN9d11TPA\n"
    "mRGunUHBcnWEvgJBQl9nJEiU0Zsnvgc/ubhPgXRR4Xq37Z0j4r7g1SgEEzwxA57d\n"
    "emyPxgcYxn/eR44/KJ4EBs+lVDR3veyJm+kXQ99b21/+jh5Xos1AnX5iItreGCc=\n"
    "-----END CERTIFICATE-----\n";

// Security constants
#define AES_KEY_SIZE 16 // 128-bit
#define NONCE_SIZE 6    // 6 bytes hex = 12 chars
#define MAX_AUTH_FAILURES 5
#define RATE_LIMIT_MSG_PER_SEC 10
#define REPLAY_WINDOW_SECONDS 300 // 5 minutes

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 3: CONFIGURATION STRUCTURE
 * ═══════════════════════════════════════════════════════════════════════ */

struct DeviceConfig {
  char collar_id[32];
  char device_secret[64]; // Stored ENCRYPTED in NVS
  char wifi_ssid[32];
  char wifi_password[64];
  char mqtt_server[64];
  uint16_t mqtt_port;
  uint8_t batch_count;
  uint8_t window_size;
  uint16_t sleep_minutes;
  uint8_t max_offline_cycles;
  bool device_active;
  bool use_hmac;
  bool provisioned; // ← NEW: First boot flag
  uint32_t config_version;
  char ota_password[32];
};

// Default EMPTY config (requires provisioning)
const DeviceConfig DEFAULT_CONFIG = {
    .collar_id = "",
    .device_secret = "",
    .wifi_ssid = "",
    .wifi_password = "",
    .mqtt_server = "",
    .mqtt_port = 8883, // ← CHANGED: MQTTS port
    .batch_count = 10,
    .window_size = 20,
    .sleep_minutes = 20,
    .max_offline_cycles = 25,
    .device_active = false, // ← CHANGED: Inactive until provisioned
    .use_hmac = true,       // ← ENFORCED: Always use HMAC
    .provisioned = false,
    .config_version = 1,
    .ota_password = ""};

DeviceConfig config;
Preferences preferences;

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 4: STATE MACHINE
 * ═══════════════════════════════════════════════════════════════════════ */

enum SystemState {
  STATE_INIT,
  STATE_PROVISIONING, // ← NEW: First boot setup
  STATE_CHECK_LIFECYCLE,
  STATE_READ_SENSORS,
  STATE_VALIDATE_DATA,
  STATE_CONNECT_WIFI,
  STATE_CONNECT_MQTT,
  STATE_SEND_DATA,
  STATE_MAINTENANCE,
  STATE_SLEEP,
  STATE_ERROR_RECOVERY,
  STATE_SECURITY_LOCKDOWN // ← NEW: Security failsafe
};

SystemState currentState = STATE_INIT;
SystemState previousState = STATE_INIT;

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 5: HARDWARE & GLOBALS
 * ═══════════════════════════════════════════════════════════════════════ */

#define SDA_PIN 8
#define SCL_PIN 9
#define ONE_WIRE_BUS 2
#define BATTERY_PIN 4
#define WDT_TIMEOUT 60
#define MQTT_QUEUE_SIZE 5

#define MQTT_TOPIC_DATA "kandang/sensor"
#define MQTT_TOPIC_DEBUG "kandang/debug"
#define MQTT_TOPIC_COMMAND "kandang/command"
#define MQTT_TOPIC_CONFIG "kandang/config"
#define MQTT_TOPIC_STATUS "kandang/status" // ← NEW: LWT topic

WiFiClient plainClient;
WiFiClientSecure secureClient;
PubSubClient mqtt(plainClient);
OneWire oneWire(ONE_WIRE_BUS);
DallasTemperature tempSensor(&oneWire);
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", 28800);
MPU9250_WE mpu9250 = MPU9250_WE(0x68); // IMU Sensor

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 6: RTC MEMORY
 * ═══════════════════════════════════════════════════════════════════════ */

#define MAX_BUFFERED_BATCHES 250

