altschmerzsiuu/hq/ESP32C3SuperMini_Production.ino
RTC_DATA_ATTR float bufMeanZ[MAX_BUFFERED_BATCHES];
RTC_DATA_ATTR float bufRmsZ[MAX_BUFFERED_BATCHES];
RTC_DATA_ATTR float bufMaxZ[MAX_BUFFERED_BATCHES];
RTC_DATA_ATTR float bufSuhu[MAX_BUFFERED_BATCHES];
RTC_DATA_ATTR unsigned long bufTimestamp[MAX_BUFFERED_BATCHES];

RTC_DATA_ATTR int bufHead = 0;
RTC_DATA_ATTR int bufCount = 0;
RTC_DATA_ATTR bool offlineMode = false;
RTC_DATA_ATTR int failedAttempts = 0;
RTC_DATA_ATTR bool maintenanceRequested = false;
RTC_DATA_ATTR uint32_t messageSequence = 0;
RTC_DATA_ATTR uint32_t bootCount = 0;
RTC_DATA_ATTR uint32_t bufferMagic = 0xDEADBEEF;
RTC_DATA_ATTR uint8_t sensorFailCount = 0;

// NEW: Security tracking
RTC_DATA_ATTR uint8_t authFailures = 0;
RTC_DATA_ATTR unsigned long lastMsgTime = 0;
RTC_DATA_ATTR uint8_t msgCountThisSec = 0;

// NEW: Offline timestamp estimation — survives deep sleep, lost on full
// power-off
RTC_DATA_ATTR unsigned long lastKnownEpoch = 0; // Last NTP-synced epoch (UTC)
RTC_DATA_ATTR uint32_t lastKnownBootCount =
    0; // Boot count when epoch was synced

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 7: MQTT QUEUE
 * ═══════════════════════════════════════════════════════════════════════ */

struct MQTTMessage {
  char topic[50];
  char payload[512];
  uint32_t sequence;
  bool valid;
};

MQTTMessage mqttQueue[MQTT_QUEUE_SIZE];
int queueHead = 0;
int queueCount = 0;

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 8: SENSOR DATA
 * ═══════════════════════════════════════════════════════════════════════ */

struct SensorReading {
  float meanZ;
  float rmsZ;
  float maxZ;
  float temperature;
  unsigned long timestamp;
  bool valid;
};

static SensorReading batchReadings[10];
static bool mpuInitSuccess = false;
static int ds18b20Count = 0;

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 9: SECURITY MODULE
 * ═══════════════════════════════════════════════════════════════════════ */

class SecurityManager {
public:
  // Get device chip ID (unique, immutable)
  static uint64_t getChipID() { return ESP.getEfuseMac(); }

  // Generate secure random nonce (6 bytes = 12 hex chars)
  static void generateNonce(char *output) {
    uint8_t random[NONCE_SIZE];
    esp_fill_random(random, NONCE_SIZE);

    for (int i = 0; i < NONCE_SIZE; i++) {
      sprintf(output + (i * 2), "%02x", random[i]);
    }
    output[NONCE_SIZE * 2] = '\0';
  }

  // Plain text pass-through for simplicity
  static void encryptSecret(const char *plaintext, char *encrypted) {
    strncpy(encrypted, plaintext, 63);
    encrypted[63] = '\0';
  }

  // Plain text pass-through for simplicity
  static void decryptSecret(const char *encrypted, char *plaintext) {
    strncpy(plaintext, encrypted, 63);
    plaintext[63] = '\0';
  }

  // Rate limiting check
  static bool checkRateLimit() {
    unsigned long currentSec = millis() / 1000;

    if (currentSec != lastMsgTime / 1000) {
      // New second - reset counter
      msgCountThisSec = 0;
      lastMsgTime = currentSec * 1000;
    }

    if (msgCountThisSec >= RATE_LIMIT_MSG_PER_SEC) {
      Serial.println("[SECURITY] Rate limit exceeded!");
      return false;
    }

    msgCountThisSec++;
    return true;
  }

  // Check for security lockdown conditions
  static bool shouldLockdown() { return authFailures >= MAX_AUTH_FAILURES; }

  // Reset auth failures (on successful send)
  static void resetAuthFailures() { authFailures = 0; }

  // Increment auth failures
  static void recordAuthFailure() {
    authFailures++;
    Serial.printf("[SECURITY] Auth failure count: %d/%d\n", authFailures,
                  MAX_AUTH_FAILURES);
  }
};

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 10: CONFIGURATION MANAGEMENT
 * ═══════════════════════════════════════════════════════════════════════ */

void loadConfiguration() {
  preferences.begin("collar-cfg", false);

  if (preferences.isKey("provisioned") &&
      preferences.getBool("provisioned", false)) {
    // Load encrypted configuration
    preferences.getString("collar_id", config.collar_id,
                          sizeof(config.collar_id));

    char encryptedSecret[64];
    preferences.getString("dev_secret", encryptedSecret,
                          sizeof(encryptedSecret));
    SecurityManager::decryptSecret(encryptedSecret, config.device_secret);

    preferences.getString("wifi_ssid", config.wifi_ssid,
                          sizeof(config.wifi_ssid));
    preferences.getString("wifi_pass", config.wifi_password,
                          sizeof(config.wifi_password));
    preferences.getString("mqtt_srv", config.mqtt_server,
                          sizeof(config.mqtt_server));
    config.mqtt_port = preferences.getUShort("mqtt_port", 8883);
    config.batch_count = preferences.getUChar("batch_cnt", 10);
    config.window_size = preferences.getUChar("window_sz", 20);
    config.sleep_minutes = preferences.getUShort("sleep_min", 20);
    config.max_offline_cycles = preferences.getUChar("max_cycles", 25);
    config.device_active = preferences.getBool("active", true);
    config.use_hmac = true; // ENFORCED
    config.provisioned = true;
    config.config_version = preferences.getUInt("config_ver", 1);
    preferences.getString("ota_pass", config.ota_password,
                          sizeof(config.ota_password));

    Serial.println("[CONFIG] Loaded from NVS (encrypted)");
  } else {
    // Not provisioned - use empty defaults
    memcpy(&config, &DEFAULT_CONFIG, sizeof(DeviceConfig));
    Serial.println("[CONFIG] NOT PROVISIONED - Enter provisioning mode");
  }

  preferences.end();
}

void saveConfiguration() {
  preferences.begin("collar-cfg", false);

  preferences.putString("collar_id", config.collar_id);

  // Encrypt device_secret before storing
  char encryptedSecret[64];
  SecurityManager::encryptSecret(config.device_secret, encryptedSecret);
  preferences.putString("dev_secret", encryptedSecret);

  preferences.putString("wifi_ssid", config.wifi_ssid);
  preferences.putString("wifi_pass", config.wifi_password);
  preferences.putString("mqtt_srv", config.mqtt_server);
  preferences.putUShort("mqtt_port", config.mqtt_port);
  preferences.putUChar("batch_cnt", config.batch_count);
  preferences.putUChar("window_sz", config.window_size);
  preferences.putUShort("sleep_min", config.sleep_minutes);
  preferences.putUChar("max_cycles", config.max_offline_cycles);
  preferences.putBool("active", config.device_active);
  preferences.putBool("provisioned", config.provisioned);
  preferences.putUInt("config_ver", config.config_version);
  preferences.putString("ota_pass", config.ota_password);

