altschmerzsiuu/hq/ESP32C3SuperMini_Production.ino
  preferences.end();
  Serial.println("[CONFIG] Saved to NVS (encrypted)");
}

void updateConfigFromMQTT(const char *json) {
  if (strstr(json, "\"sleep_minutes\":")) {
    int newSleep = atoi(strstr(json, "\"sleep_minutes\":") + 16);
    if (newSleep >= 5 && newSleep <= 60) {
      config.sleep_minutes = newSleep;
      config.config_version++;
      saveConfiguration();
      Serial.printf("[CONFIG] Updated sleep_minutes to %d\n", newSleep);
    }
  }

  if (strstr(json, "\"device_active\":false")) {
    config.device_active = false;
    saveConfiguration();
    Serial.println("[CONFIG] Device DISABLED remotely!");
  }
}

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 11: PROVISIONING MODE
 * ═══════════════════════════════════════════════════════════════════════ */

void handleProvisioning() {
  Serial.println("\n╔════════════════════════════════════════════╗");
  Serial.println("║  PROVISIONING MODE - FIRST BOOT SETUP      ║");
  Serial.println("╚════════════════════════════════════════════╝");
  Serial.println("Enter configuration via Serial (115200 baud):");
  Serial.println(
      "Format: COLLAR_ID,DEVICE_SECRET,WIFI_SSID,WIFI_PASS,MQTT_SERVER");
  Serial.println("\nWaiting for input... (60 seconds timeout)");

  unsigned long start = millis();
  String input = "";

  while (millis() - start < 60000) {
    if (Serial.available()) {
      char c = Serial.read();
      if (c == '\n' || c == '\r') {
        if (input.length() > 0)
          break;
      } else {
        input += c;
      }
    }
    delay(100);
    esp_task_wdt_reset();
  }

  if (input.length() == 0) {
    Serial.println("[PROVISIONING] Timeout - will retry on next boot");
    esp_deep_sleep(10 * 1000000ULL); // Sleep 10 sec
    return;
  }

  // Parse input
  int idx1 = input.indexOf(',');
  int idx2 = input.indexOf(',', idx1 + 1);
  int idx3 = input.indexOf(',', idx2 + 1);
  int idx4 = input.indexOf(',', idx3 + 1);

  if (idx1 > 0 && idx2 > 0 && idx3 > 0 && idx4 > 0) {
    input.substring(0, idx1).toCharArray(config.collar_id,
                                         sizeof(config.collar_id));
    input.substring(idx1 + 1, idx2)
        .toCharArray(config.device_secret, sizeof(config.device_secret));
    input.substring(idx2 + 1, idx3)
        .toCharArray(config.wifi_ssid, sizeof(config.wifi_ssid));
    input.substring(idx3 + 1, idx4)
        .toCharArray(config.wifi_password, sizeof(config.wifi_password));
    String serverStr = input.substring(idx4 + 1);
    serverStr.trim();
    int colonIdx = serverStr.indexOf(':');
    if (colonIdx > 0) {
      serverStr.substring(0, colonIdx)
          .toCharArray(config.mqtt_server, sizeof(config.mqtt_server));
      config.mqtt_port = serverStr.substring(colonIdx + 1).toInt();
    } else {
      serverStr.toCharArray(config.mqtt_server, sizeof(config.mqtt_server));
      // Auto-detect local IP address (starts with digit) -> default to 1883,
      // otherwise 8883
      if (isdigit(config.mqtt_server[0])) {
        config.mqtt_port = 1883;
      } else {
        config.mqtt_port = 8883;
      }
    }

    config.device_active = true;
    config.use_hmac = true;
    config.provisioned = true;

    char nonce[13];
    SecurityManager::generateNonce(nonce);
    strcpy(config.ota_password, nonce);

    saveConfiguration();

    Serial.println("\n[PROVISIONING] SUCCESS!");
    Serial.printf("Collar ID: %s\n", config.collar_id);
    Serial.printf("Chip ID: %llX\n", SecurityManager::getChipID());
    Serial.println("Rebooting...\n");

    delay(2000);
    ESP.restart();
  } else {
    Serial.println("[PROVISIONING] Invalid format!");
    esp_deep_sleep(10 * 1000000ULL);
  }
}

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 12: LOGGING SYSTEM
 * ═══════════════════════════════════════════════════════════════════════ */

void mqttLog(const char *level, const char *message) {
  char timestamp[20];
  if (timeClient.isTimeSet()) {
    snprintf(timestamp, sizeof(timestamp), "%lu", timeClient.getEpochTime());
  } else {
    snprintf(timestamp, sizeof(timestamp), "%lu", millis() / 1000);
  }

  Serial.printf("[%s] [%s] %s\n", timestamp, level, message);

  if (mqtt.connected()) {
    char payload[300];
    snprintf(payload, sizeof(payload),
             "{\"ts\":%s,\"collar\":\"%s\",\"fw\":\"%s\",\"chip\":\"%llX\","
             "\"lvl\":\"%s\",\"msg\":\"%s\"}",
             timestamp, config.collar_id, FIRMWARE_VERSION,
             SecurityManager::getChipID(), level, message);
    mqtt.publish(MQTT_TOPIC_DEBUG, payload, false);
  }
}

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 13: SENSOR MODULES (Unchanged from v4.0)
 * ═══════════════════════════════════════════════════════════════════════ */

class SensorManager {
public:
  static bool initMPU9250() {
    Wire.begin(SDA_PIN, SCL_PIN);
    Wire.setClock(100000);

    // Wake up the MPU chip (works for MPU6050, MPU6500, MPU9250)
    Wire.beginTransmission(0x68);
    Wire.write(0x6B); // PWR_MGMT_1 register
    Wire.write(0x00); // Wake up
    byte error = Wire.endTransmission();

    bool ok = (error == 0);
    mpuInitSuccess = ok;
    Serial.printf("[DEBUG SENSOR] MPU Init (Raw I2C): %s\n",
                  ok ? "SUCCESS" : "FAILED");
    return ok;
  }

  static float readZAxis() {
    Wire.beginTransmission(0x68);
    Wire.write(0x3F); // ACCEL_ZOUT_H
    byte error = Wire.endTransmission(false);

    if (error != 0) {
      Serial.println("[DEBUG SENSOR] Raw Z Read Failed (I2C Error)");
      return NAN;
    }

    Wire.requestFrom(0x68, 2);
    if (Wire.available() >= 2) {
      int16_t rawZ = (Wire.read() << 8) | Wire.read();
      float gZ = rawZ / 16384.0; // standard 2g sensitivity scale factor
      Serial.printf("[DEBUG SENSOR] Raw Z axis: %.3f\n", gZ);
      return gZ;
    }

    Serial.println("[DEBUG SENSOR] Raw Z Read Failed (No data)");
    return NAN;
  }

  static bool initDS18B20() {
    pinMode(ONE_WIRE_BUS, INPUT_PULLUP);
    tempSensor.begin();
    int count = tempSensor.getDeviceCount();
    ds18b20Count = count;
    Serial.printf("[DEBUG SENSOR] DS18B20 Count: %d\n", count);
    return (count > 0);
  }

  static float readTemperature() {
    tempSensor.requestTemperatures();
    float temp = tempSensor.getTempCByIndex(0);
    Serial.printf("[DEBUG SENSOR] Raw Temp: %.2f C\n", temp);
    return (temp >= -50 && temp <= 100) ? temp : 25.0;
  }

  static bool resetSensorBus() {
    Serial.println("[DEBUG SENSOR] Resetting I2C bus...");
    Wire.end();
    delay(100);
    Wire.begin(SDA_PIN, SCL_PIN);
    Wire.setClock(100000);
    delay(100);
    return initMPU9250();
  }
};

class DataValidator {
public:
  static bool isValidAccel(float value) {
    return !isnan(value) && value >= -5.0 && value <= 5.0;
  }

