altschmerzsiuu/hq/ESP32C3SuperMini_Production.ino
  static bool isValidTemp(float value) {
    return !isnan(value) && value >= -40.0 && value <= 60.0;
  }

  static bool isValidReading(const SensorReading &reading) {
    return isValidAccel(reading.meanZ) && isValidAccel(reading.rmsZ) &&
           isValidAccel(reading.maxZ) && isValidTemp(reading.temperature);
  }
};

class BatteryMonitor {
public:
  static float readVoltage(int &percent) {
    int raw = analogRead(BATTERY_PIN);
    float pinVoltage = (raw / 4095.0) * 3.3;
    float battVoltage = pinVoltage * 2;
    percent = map((long)(battVoltage * 100), 320, 420, 0, 100);
    percent = constrain(percent, 0, 100);
    return battVoltage;
  }

  static bool isCritical() {
    int pct;
    float voltage = readVoltage(pct);
    return (pct < 10 || voltage < 3.3);
  }
};

class BufferManager {
public:
  static bool checkIntegrity() {
    if (bufferMagic != 0xDEADBEEF) {
      bufHead = 0;
      bufCount = 0;
      bufferMagic = 0xDEADBEEF;
      return false;
    }
    return true;
  }

  static void write(const SensorReading &reading) {
    int idx = bufHead % MAX_BUFFERED_BATCHES;
    bufMeanZ[idx] = reading.meanZ;
    bufRmsZ[idx] = reading.rmsZ;
    bufMaxZ[idx] = reading.maxZ;
    bufSuhu[idx] = reading.temperature;
    bufTimestamp[idx] = reading.timestamp;
    bufHead = (bufHead + 1) % MAX_BUFFERED_BATCHES;
    if (bufCount < MAX_BUFFERED_BATCHES)
      bufCount++;
  }

  static SensorReading read(int index) {
    int idx = (bufHead - bufCount + index + MAX_BUFFERED_BATCHES) %
              MAX_BUFFERED_BATCHES;
    SensorReading reading;
    reading.meanZ = bufMeanZ[idx];
    reading.rmsZ = bufRmsZ[idx];
    reading.maxZ = bufMaxZ[idx];
    reading.temperature = bufSuhu[idx];
    reading.timestamp = bufTimestamp[idx];
    reading.valid = true;
    return reading;
  }

  static void clear() {
    bufHead = 0;
    bufCount = 0;
  }
};

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 14: MQTT QUEUE
 * ═══════════════════════════════════════════════════════════════════════ */

class MQTTQueue {
public:
  static bool enqueue(const char *topic, const char *payload) {
    if (queueCount >= MQTT_QUEUE_SIZE) {
      queueHead = (queueHead + 1) % MQTT_QUEUE_SIZE;
      queueCount--;
    }

    int idx = (queueHead + queueCount) % MQTT_QUEUE_SIZE;
    strncpy(mqttQueue[idx].topic, topic, sizeof(mqttQueue[idx].topic) - 1);
    strncpy(mqttQueue[idx].payload, payload,
            sizeof(mqttQueue[idx].payload) - 1);
    mqttQueue[idx].sequence = messageSequence++;
    mqttQueue[idx].valid = true;
    queueCount++;
    return true;
  }

  static int flush() {
    if (!mqtt.connected())
      return 0;

    int sentCount = 0;
    while (queueCount > 0) {
      int idx = queueHead;

      if (mqttQueue[idx].valid &&
          publishWithRetry(mqttQueue[idx].topic, mqttQueue[idx].payload)) {
        sentCount++;
        mqttQueue[idx].valid = false;
        queueHead = (queueHead + 1) % MQTT_QUEUE_SIZE;
        queueCount--;
      } else {
        break;
      }

      mqtt.loop();
      esp_task_wdt_reset();
    }

    return sentCount;
  }

private:
  static bool publishWithRetry(const char *topic, const char *payload,
                               int maxRetries = 3) {
    for (int attempt = 1; attempt <= maxRetries; attempt++) {
      if (mqtt.publish(topic, payload)) {
        return true;
      }
      delay(200 * attempt);
      mqtt.loop();
    }
    return false;
  }
};

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 15: NETWORK LAYER (UPGRADED)
 * ═══════════════════════════════════════════════════════════════════════ */

class CollarNetworkManager {
public:
  static bool connectWiFi() {
    mqttLog("INFO", "Connecting WiFi...");

    // 1. KITA BERSIHKAN SPASI YANG NYANGKUT DI MEMORI SECARA PAKSA!
    String safeSSID = String(config.wifi_ssid);
    safeSSID.trim(); // Hapus spasi di awal/akhir nama WiFi
    String safePASS = String(config.wifi_password);
    safePASS.trim(); // Hapus spasi di awal/akhir Password

    Serial.printf("[DEBUG] WiFi Target (Tanpa Spasi): '%s'\n",
                  safeSSID.c_str());
    Serial.printf("[DEBUG] Pass Target (Tanpa Spasi): '%s'\n",
                  safePASS.c_str());

    // 2. Persiapan Radio WiFi
    WiFi.mode(WIFI_STA);
    WiFi.disconnect(true);

    // 3. JEDA 1 DETIK (PERSIS SEPERTI DI FILE TESTING)
    delay(1000);

    Serial.println("[DEBUG] Mulai Scan BSSID...");
    int n = WiFi.scanNetworks();

    uint8_t bestBSSID[6];
    int bestRSSI = -100;
    bool found = false;

    // 4. Cari WiFi dengan sinyal terkuat
    for (int i = 0; i < n; i++) {
      if (WiFi.SSID(i) == safeSSID) {
        if (WiFi.RSSI(i) > bestRSSI) {
          bestRSSI = WiFi.RSSI(i);
          memcpy(bestBSSID, WiFi.BSSID(i), 6);
          found = true;
        }
      }
    }

    // 5. Turunkan daya pancar ESP32-C3 SuperMini
    WiFi.setTxPower(WIFI_POWER_8_5dBm);

    // 6. Eksekusi koneksi
    if (found) {
      Serial.printf("[WIFI] Konek ke MAC Address 'sungg': "
                    "%02X:%02X:%02X:%02X:%02X:%02X\n",
                    bestBSSID[0], bestBSSID[1], bestBSSID[2], bestBSSID[3],
                    bestBSSID[4], bestBSSID[5]);
      // Gunakan c_str() agar format String berubah jadi const char*
      WiFi.begin(safeSSID.c_str(), safePASS.c_str(), 0, bestBSSID);
    } else {
      Serial.println("[WIFI] GAGAL SCAN! BSSID target tidak ditemukan, coba "
                     "cara biasa...");
      WiFi.begin(safeSSID.c_str(), safePASS.c_str());
    }

    // 7. Tunggu koneksi (Timeout 20 Detik)
    unsigned long start = millis();
    int attempts = 0;

    while (WiFi.status() != WL_CONNECTED && millis() - start < 20000) {
      delay(1000); // Jeda 1 detik setiap cek, persis kayak testing
      attempts++;
      Serial.printf("[Detik %d] Status: %d\n", attempts, WiFi.status());
      esp_task_wdt_reset(); // Jangan lupa reset Watchdog biar nggak restart!
    }
    Serial.println();

    if (WiFi.status() == WL_CONNECTED) {
      char msg[100];
      snprintf(msg, sizeof(msg), "WiFi OK - IP: %s",
               WiFi.localIP().toString().c_str());
      mqttLog("INFO", msg);
      setupOTA();
      syncTime();
      return true;
    }

