altschmerzsiuu/hq/ESP32C3SuperMini_Production.ino
    mqttLog("ERROR", "WiFi timeout");
    return false;
  }

  static bool connectMQTT() {
    // ═══ DUAL MODE: MQTTS (TLS) or MQTT (Plain TCP) ═══
    if (config.mqtt_port == 1883) {
      mqtt.setClient(plainClient);
      mqtt.setServer(config.mqtt_server, config.mqtt_port);
      mqtt.setCallback(mqttCallback);
      mqtt.setBufferSize(1024);
      mqttLog("INFO", "Connecting plain MQTT (no TLS)...");
    } else {
      secureClient.setCACert(ca_cert);
      // ═══ DEBUG TLS ═══
      Serial.println("[TLS] Testing connection to server...");
      if (secureClient.connect(config.mqtt_server, config.mqtt_port)) {
        Serial.println("[TLS] Raw TCP+TLS connection: SUCCESS");
        secureClient.stop();
        delay(500);
      } else {
        Serial.printf("[TLS] Raw TCP+TLS connection: FAILED\n");
        Serial.printf("[TLS] Last SSL error: %d\n",
                      secureClient.lastError(nullptr, 0));
      }

      mqtt.setClient(secureClient);
      mqtt.setServer(config.mqtt_server, config.mqtt_port);
      mqtt.setCallback(mqttCallback);
      mqtt.setBufferSize(1024);
      mqttLog("INFO", "Connecting secure MQTTS (TLS)...");
    }

    // ═══ UPGRADED: Last Will Testament (LWT) ═══
    char lwt_topic[80];
    snprintf(lwt_topic, sizeof(lwt_topic), "%s/%s", MQTT_TOPIC_STATUS,
             config.collar_id);

    // ═══ SIMPLIFIED: MQTT Authentication ═══
    if (mqtt.connect(config.collar_id,     // client ID
                     "hectra-bridge",      // MQTT username
                     "Br1dge@Hectra#2026", // MQTT password
                     lwt_topic,            // LWT topic
                     0,                    // QoS
                     true,                 // retain
                     "OFFLINE"             // LWT message
                     )) {
      if (config.mqtt_port == 1883) {
        mqttLog("INFO", "MQTT connected (plain TCP)");
      } else {
        mqttLog("INFO", "MQTTS connected (TLS)");
      }

      // Publish ONLINE status
      mqtt.publish(lwt_topic, "ONLINE", true);

      // Subscribe to command topics
      char cmdTopic[80];
      snprintf(cmdTopic, sizeof(cmdTopic), "%s/%s", MQTT_TOPIC_COMMAND,
               config.collar_id);
      mqtt.subscribe(cmdTopic);

      snprintf(cmdTopic, sizeof(cmdTopic), "%s/%s", MQTT_TOPIC_CONFIG,
               config.collar_id);
      mqtt.subscribe(cmdTopic);

      return true;
    }

    char msg[100];
    snprintf(msg, sizeof(msg), "MQTT connect failed - state: %d", mqtt.state());
    mqttLog("ERROR", msg);
    SecurityManager::recordAuthFailure();
    return false;
  }

private:
  static void syncTime() {
    timeClient.begin();
    int attempts = 0;
    while (!timeClient.update() && attempts < 3) {
      delay(1000);
      attempts++;
      esp_task_wdt_reset();
    }

    if (attempts < 3) {
      lastKnownEpoch = timeClient.getEpochTime(); // Save for offline estimation
      lastKnownBootCount = bootCount;
      char msg[100];
      snprintf(msg, sizeof(msg), "NTP synced: %lu", lastKnownEpoch);
      mqttLog("INFO", msg);
    }
  }

  static void setupOTA() {
    ArduinoOTA.setHostname(config.collar_id);
    ArduinoOTA.setPassword(config.ota_password);
    ArduinoOTA.onStart([]() { mqttLog("INFO", "OTA Start"); });
    ArduinoOTA.onEnd(
        []() { mqttLog("INFO", "OTA End - TODO: Verify firmware signature"); });
    ArduinoOTA.onError([](ota_error_t error) {
      char msg[50];
      snprintf(msg, sizeof(msg), "OTA Error: %u", error);
      mqttLog("ERROR", msg);
    });
    ArduinoOTA.begin();
  }

  static void mqttCallback(char *topic, byte *payload, unsigned int length) {
    char message[length + 1];
    for (unsigned int i = 0; i < length; i++)
      message[i] = (char)payload[i];
    message[length] = '\0';

    if (strstr(topic, MQTT_TOPIC_COMMAND)) {
      if (strstr(message, "START_OTA")) {
        maintenanceRequested = true;
        mqttLog("WARN", "OTA Mode activated");
      } else if (strstr(message, "REBOOT")) {
        mqttLog("WARN", "Remote reboot");
        ESP.restart();
      }
    }

    if (strstr(topic, MQTT_TOPIC_CONFIG)) {
      updateConfigFromMQTT(message);
    }
  }
};

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 16: STATE MACHINE HANDLERS
 * ═══════════════════════════════════════════════════════════════════════ */

void transitionToState(SystemState newState) {
  previousState = currentState;
  currentState = newState;

  const char *stateNames[] = {
      "INIT",          "PROVISIONING", "CHECK_LIFECYCLE", "READ_SENSORS",
      "VALIDATE_DATA", "CONNECT_WIFI", "CONNECT_MQTT",    "SEND_DATA",
      "MAINTENANCE",   "SLEEP",        "ERROR_RECOVERY",  "SECURITY_LOCKDOWN"};

  char msg[100];
  snprintf(msg, sizeof(msg), "State: %s → %s", stateNames[previousState],
           stateNames[newState]);
  mqttLog("INFO", msg);
}

void handleStateInit() {
  Serial.begin(115200);
  // Wait up to 3 seconds for Serial Monitor to connect (necessary for ESP32-C3
  // USB CDC)
  for (int i = 0; i < 30; i++) {
    if (Serial)
      break;
    delay(100);
  }

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdt_config = {.timeout_ms = WDT_TIMEOUT * 1000,
                                      .idle_core_mask = 0,
                                      .trigger_panic = true};
  // In ESP32 Core v3, WDT might already be initialized. If so, reconfigure it.
  if (esp_task_wdt_init(&wdt_config) == ESP_ERR_INVALID_STATE) {
    esp_task_wdt_reconfigure(&wdt_config);
  }
#else
  esp_task_wdt_init(WDT_TIMEOUT, true);
#endif
  esp_task_wdt_add(NULL);

  Serial.println("\n╔════════════════════════════════════════════╗");
  Serial.println("║  SMART COLLAR v4.5 SECURE                  ║");
  Serial.println("║  MQTTS | HMAC | AES | Device Binding       ║");
  Serial.println("╚════════════════════════════════════════════╝");

  char bootMsg[150];
  snprintf(bootMsg, sizeof(bootMsg), "Boot #%lu | FW: %s | Chip: %llX",
           bootCount++, FIRMWARE_VERSION, SecurityManager::getChipID());
  mqttLog("INFO", bootMsg);

