altschmerzsiuu/hq/ESP32C3SuperMini_Production.ino
  loadConfiguration();
  BufferManager::checkIntegrity();

  if (!config.provisioned) {
    transitionToState(STATE_PROVISIONING);
  } else {
    transitionToState(STATE_CHECK_LIFECYCLE);
  }
}

void handleStateProvisioning() {
  handleProvisioning();
  // Never returns - reboots after provisioning
}

void handleStateCheckLifecycle() {
  // Check for security lockdown
  if (SecurityManager::shouldLockdown()) {
    mqttLog("CRITICAL", "Security lockdown activated");
    transitionToState(STATE_SECURITY_LOCKDOWN);
    return;
  }

  if (!config.device_active) {
    mqttLog("CRITICAL", "Device disabled");
    transitionToState(STATE_SLEEP);
    return;
  }

  if (BatteryMonitor::isCritical()) {
    mqttLog("CRITICAL", "Battery critical");
    config.sleep_minutes = 60;
  }

  transitionToState(STATE_READ_SENSORS);
}

void handleStateReadSensors() {
  if (!SensorManager::initMPU9250()) {
    sensorFailCount++;
    if (sensorFailCount >= 3) {
      SensorManager::resetSensorBus();
      sensorFailCount = 0;
    }
  }
  SensorManager::initDS18B20();

  for (int batch = 0; batch < config.batch_count; batch++) {
    float sumZ = 0, sumSqZ = 0, maxZ = -100;
    int validSamples = 0;

    for (int i = 0; i < config.window_size; i++) {
      float z = SensorManager::readZAxis();
      if (!isnan(z)) {
        sumZ += z;
        sumSqZ += (z * z);
        if (z > maxZ)
          maxZ = z;
        validSamples++;
      }
      delay(50);
    }

    if (validSamples >= config.window_size / 2) {
      batchReadings[batch].meanZ = sumZ / validSamples;
      batchReadings[batch].rmsZ = sqrt(sumSqZ / validSamples);
      batchReadings[batch].maxZ = maxZ;
      batchReadings[batch].temperature = SensorManager::readTemperature();
      batchReadings[batch].valid = true;
    } else {
      batchReadings[batch].valid = false;
    }

    esp_task_wdt_reset();
  }

  transitionToState(STATE_VALIDATE_DATA);
}

void handleStateValidateData() {
  SensorReading fallback = {-1.0, 1.0, -0.8, 25.0, 0, true};
  int validBatches = 0;

  for (int i = 0; i < config.batch_count; i++) {
    if (!batchReadings[i].valid) {
      batchReadings[i] = (i > 0) ? batchReadings[i - 1] : fallback;
    }
    if (DataValidator::isValidReading(batchReadings[i])) {
      validBatches++;
    }
  }

  if (validBatches == 0) {
    sensorFailCount++;
    transitionToState(STATE_ERROR_RECOVERY);
    return;
  }

  sensorFailCount = 0;
  transitionToState(STATE_CONNECT_WIFI);
}

void handleStateConnectWiFi() {
  if (CollarNetworkManager::connectWiFi()) {
    transitionToState(STATE_CONNECT_MQTT);
  } else {
    offlineMode = true;
    failedAttempts++;
    transitionToState(STATE_SLEEP);
  }
}

void handleStateConnectMQTT() {
  if (CollarNetworkManager::connectMQTT()) {
    SecurityManager::resetAuthFailures();
    offlineMode = false;
    transitionToState(STATE_SEND_DATA);
  } else {
    offlineMode = true;
    transitionToState(STATE_SLEEP);
  }
}

void handleStateSendData() {
  unsigned long currentEpoch = timeClient.getEpochTime();

  // ── SIMPAN TIMESTAMP ke batchReadings (belum tulis ke buffer) ──
  for (int i = 0; i < config.batch_count; i++) {
    batchReadings[i].timestamp = currentEpoch - (config.batch_count - 1 - i);
  }

  // ── TULIS batch baru ke buffer HANYA SEKALI ──
  for (int i = 0; i < config.batch_count; i++) {
    if (batchReadings[i].valid) {
      BufferManager::write(batchReadings[i]);
    }
  }

  int batPct;
  float batVolt = BatteryMonitor::readVoltage(batPct);
  uint64_t chipID = SecurityManager::getChipID();

  // ── Snapshot bufCount dulu sebelum apapun berubah ──
  int snapshotCount = bufCount;

  for (int i = 0; i < snapshotCount; i++) {
    if (!SecurityManager::checkRateLimit()) {
      delay(1000);
      continue;
    }

    SensorReading reading = BufferManager::read(i);

    char nonce[NONCE_SIZE * 2 + 1];
    SecurityManager::generateNonce(nonce);

    char finalPayload[700];
    snprintf(finalPayload, sizeof(finalPayload),
             "{"
             "\"collar_id\":\"%s\","
             "\"device_secret\":\"%s\","
             "\"chip_id\":\"%llX\","
             "\"fw_version\":\"%s\","
             "\"seq\":%lu,"
             "\"timestamp\":%lu,"
             "\"nonce\":\"%s\","
             "\"mean_z\":%.3f,\"rms_z\":%.3f,\"max_z\":%.3f,"
             "\"temperature\":%.2f,"
             "\"battery_voltage\":%.2f,"
             "\"battery_percent\":%d"
             "}",
             config.collar_id, config.device_secret, chipID, FIRMWARE_VERSION,
             messageSequence + i, reading.timestamp, nonce, reading.meanZ,
             reading.rmsZ, reading.maxZ, reading.temperature, batVolt, batPct);

    MQTTQueue::enqueue(MQTT_TOPIC_DATA, finalPayload);
    esp_task_wdt_reset();
  }

  int sent = MQTTQueue::flush();

  char msg[100];
  snprintf(msg, sizeof(msg), "Sent %d/%d batches", sent, snapshotCount);
  mqttLog("INFO", msg);

  // ── Baru clear jika SEMUA terkirim ──
  if (sent == snapshotCount) {
    BufferManager::clear();
    offlineMode = false;
    failedAttempts = 0;
    SecurityManager::resetAuthFailures();
  } else if (sent > 0) {
    int remaining = snapshotCount - sent;
    for (int i = 0; i < remaining; i++) {
      SensorReading r = BufferManager::read(sent + i);
      int idx = i % MAX_BUFFERED_BATCHES;
      bufMeanZ[idx] = r.meanZ;
      bufRmsZ[idx] = r.rmsZ;
      bufMaxZ[idx] = r.maxZ;
      bufSuhu[idx] = r.temperature;
      bufTimestamp[idx] = r.timestamp;
    }
    bufHead = remaining % MAX_BUFFERED_BATCHES;
    bufCount = remaining;
    mqttLog("WARN", "Partial send - will retry remaining on next boot");
  } else {
    // sent == 0: nggak ada yang kekirim, buffer dibiarkan utuh
    mqttLog("ERROR", "Send failed - all data retained in buffer");
  }

  transitionToState(STATE_MAINTENANCE);
}

void handleStateMaintenance() {
  for (int i = 0; i < 100; i++) {
    mqtt.loop();
    ArduinoOTA.handle();
    delay(100);
    if (i % 20 == 0)
      esp_task_wdt_reset();
  }

  if (maintenanceRequested) {
    maintenanceRequested = false;
    mqttLog("WARN", "OTA window - 3 mins");

    unsigned long start = millis();
    while (millis() - start < 180000) {
      ArduinoOTA.handle();
      mqtt.loop();
      if (millis() % 10000 == 0)
        esp_task_wdt_reset();
      delay(10);
    }
    mqttLog("INFO", "OTA timeout");
  }

  transitionToState(STATE_SLEEP);
}

void handleStateErrorRecovery() {
  mqttLog("ERROR", "Error recovery");
  SensorManager::resetSensorBus();
  config.sleep_minutes = 30;
  transitionToState(STATE_SLEEP);
}

void handleStateSecurityLockdown() {
  mqttLog("CRITICAL", "SECURITY LOCKDOWN - Too many auth failures");
  mqttLog("INFO", "Only OTA/reset allowed");

