altschmerzsiuu/hq/ESP32C3SuperMini_Production.ino
  // Stay awake for OTA only
  for (int i = 0; i < 300; i++) { // 5 minutes
    ArduinoOTA.handle();
    delay(1000);
    if (i % 10 == 0)
      esp_task_wdt_reset();
  }

  // Extended sleep
  config.sleep_minutes = 120; // 2 hours
  transitionToState(STATE_SLEEP);
}

void handleStateSleep() {
  if (offlineMode) {
    unsigned long estimatedEpoch = 0;
    if (lastKnownEpoch > 0) {
      estimatedEpoch =
          lastKnownEpoch + ((unsigned long)(bootCount - lastKnownBootCount) *
                            config.sleep_minutes * 60UL);
    }

    for (int i = 0; i < config.batch_count; i++) {
      if (batchReadings[i].valid) {
        batchReadings[i].timestamp =
            (estimatedEpoch > 0)
                ? estimatedEpoch - (unsigned long)(config.batch_count - 1 - i)
                : 0;
        BufferManager::write(batchReadings[i]);
      }
    }

    char offlineMsg[100];
    snprintf(offlineMsg, sizeof(offlineMsg),
             "Offline - buffered %d/%d (est epoch: %lu)", bufCount,
             MAX_BUFFERED_BATCHES, estimatedEpoch);
    mqttLog("WARN", offlineMsg);
  }

  char msg[100];
  snprintf(msg, sizeof(msg), "Sleep %d mins | Boot: %lu | Buffer: %d",
           config.sleep_minutes, bootCount, bufCount);
  mqttLog("INFO", msg);

  Serial.flush();
  mqtt.disconnect();
  WiFi.disconnect(true);
  esp_task_wdt_delete(NULL);

  esp_sleep_enable_timer_wakeup((uint64_t)config.sleep_minutes * 60 *
                                1000000ULL);
  esp_deep_sleep_start();
}

/* ═══════════════════════════════════════════════════════════════════════
 * SECTION 17: MAIN ENTRY POINT
 * ═══════════════════════════════════════════════════════════════════════ */

void setup() {
  currentState = STATE_INIT;

  while (true) {
    switch (currentState) {
    case STATE_INIT:
      handleStateInit();
      break;
    case STATE_PROVISIONING:
      handleStateProvisioning();
      break;
    case STATE_CHECK_LIFECYCLE:
      handleStateCheckLifecycle();
      break;
    case STATE_READ_SENSORS:
      handleStateReadSensors();
      break;
    case STATE_VALIDATE_DATA:
      handleStateValidateData();
      break;
    case STATE_CONNECT_WIFI:
      handleStateConnectWiFi();
      break;
    case STATE_CONNECT_MQTT:
      handleStateConnectMQTT();
      break;
    case STATE_SEND_DATA:
      handleStateSendData();
      break;
    case STATE_MAINTENANCE:
      handleStateMaintenance();
      break;
    case STATE_ERROR_RECOVERY:
      handleStateErrorRecovery();
      break;
    case STATE_SECURITY_LOCKDOWN:
      handleStateSecurityLockdown();
      break;
    case STATE_SLEEP:
      handleStateSleep();
      break;
    }

    esp_task_wdt_reset();
    if (currentState == STATE_SLEEP)
      break;
  }
}

void loop() {
  // Not used
}